In [2]:
pip install --upgrade pip

Requirement already satisfied: pip in /Users/aergan/Desktop/AE/Codes/online_retail/venv/lib/python3.10/site-packages (24.2)
Note: you may need to restart the kernel to use updated packages.

In [3]:
!pip install numpy
!pip install pandas

Requirement already satisfied: numpy in /Users/aergan/Desktop/AE/Codes/online_retail/venv/lib/python3.10/site-packages (2.0.1)
Requirement already satisfied: pandas in /Users/aergan/Desktop/AE/Codes/online_retail/venv/lib/python3.10/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.22.4 in /Users/aergan/Desktop/AE/Codes/online_retail/venv/lib/python3.10/site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/aergan/Desktop/AE/Codes/online_retail/venv/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/aergan/Desktop/AE/Codes/online_retail/venv/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Users/aergan/Desktop/AE/Codes/online_retail/venv/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/aergan/Desktop/AE/Codes/online_retail/venv/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
import pandas as pd

In [5]:
file_path = "/Users/aergan/Desktop/AE/Data/online_retail/online_retail_II.csv"
data = pd.read_csv(file_path)
df = data.copy()

In [6]:
df.head(3)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom

In [61]:
df['Invoice'].value_counts()

Invoice
537434     675
538071     652
537638     601
537237     597
536876     593
          ...
C489504      1
C489476      1
489467       1
489463       1
C538164      1
Name: count, Length: 28816, dtype: int64

In [58]:
df[(df['Customer ID'] == 13085.0)]['Invoice'].value_counts()

Invoice
496166     19
496092     17
490068      9
489434      8
490069      5
489435      4
C527339     1
Name: count, dtype: int64

In [63]:
df[df['Invoice'] == '537434']

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
516208,537434,20685,DOORMAT RED RETROSPOT,1,12/6/2010 16:57,14.43,NaN,United Kingdom
516209,537434,20699,MOUSEY LONG LEGS SOFT TOY,1,12/6/2010 16:57,5.06,NaN,United Kingdom
516210,537434,20713,JUMBO BAG OWLS,1,12/6/2010 16:57,4.21,NaN,United Kingdom
516211,537434,20719,WOODLAND CHARLOTTE BAG,3,12/6/2010 16:57,1.66,NaN,United Kingdom
516212,537434,20725,LUNCH BAG RED RETROSPOT,4,12/6/2010 16:57,4.21,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
516878,537434,20652,BLUE POLKADOT LUGGAGE TAG,2,12/6/2010 16:57,2.51,NaN,United Kingdom
516879,537434,20658,RED RETROSPOT LUGGAGE TAG,1,12/6/2010 16:57,2.51,NaN,United Kingdom
516880,537434,20665,RED RETROSPOT PURSE,1,12/6/2010 16:57,5.91,NaN,United Kingdom
516881,537434,20682,RED RETROSPOT CHILDRENS UMBRELLA,1,12/6/2010 16:57,6.77,NaN,United Kingdom
516882,537434,20684,STRAWBERRY DREAM CHILDS UMBRELLA,1,12/6/2010 16:57,6.77,NaN,United Kingdom

### Toplam kaç satır veri var?

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525461 entries, 0 to 525460
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      525461 non-null  object
 1   StockCode    525461 non-null  object
 2   Description  522533 non-null  object
 3   Quantity     525461 non-null  int64
 4   InvoiceDate  525461 non-null  object
 5   Price        525461 non-null  float64
 6   Customer ID  417534 non-null  float64
 7   Country      525461 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 32.1+ MB

In [8]:
print('Total row:', df.shape[0])
print('Total column:', df.shape[1])

Total row: 525461
Total column: 8

Tüm description'ları birbirinden farklı mı?

In [9]:
df['Description'].nunique()

4681

In [10]:
df['Description'].value_counts()

Description
WHITE HANGING HEART T-LIGHT HOLDER    3549
REGENCY CAKESTAND 3 TIER              2212
STRAWBERRY CERAMIC TRINKET BOX        1843
PACK OF 72 RETRO SPOT CAKE CASES      1466
ASSORTED COLOUR BIRD ORNAMENT         1457
                                      ...
HEN PARTY BANNER TAPE                    1
?sold individually?                      1
NEW BAROQUE BLACK BOXES                  1
SILICON CUBE 25W, BLUE                   1
6 HOOK JEWEL STAND LILAC DRESS           1
Name: count, Length: 4681, dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525461 entries, 0 to 525460
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      525461 non-null  object
 1   StockCode    525461 non-null  object
 2   Description  522533 non-null  object
 3   Quantity     525461 non-null  int64
 4   InvoiceDate  525461 non-null  object
 5   Price        525461 non-null  float64
 6   Customer ID  417534 non-null  float64
 7   Country      525461 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 32.1+ MB

### Eşsiz müşteri sayısı

In [12]:
unique_customers = df['Customer ID'].nunique()
print('Unique customers:', unique_customers)

Unique customers: 4383

In [13]:
df.isnull().any()

Invoice        False
StockCode      False
Description     True
Quantity       False
InvoiceDate    False
Price          False
Customer ID     True
Country        False
dtype: bool

### Null değerler mevcut mu?

In [14]:
df.loc[:, ['Description', 'Customer ID']].isnull().sum()

Description      2928
Customer ID    107927
dtype: int64

### Eşsiz ürün sayısı

In [15]:
unique_customers = df['StockCode'].nunique()
print('Unique product:', unique_customers)

Unique product: 4632

### Hangi üründen kaçar tane mevcut?

In [16]:
df['StockCode'].value_counts()

StockCode
85123A    3516
22423     2221
85099B    2057
21212     1933
21232     1843
          ...
72045A       1
21863        1
21862        1
21052        1
79151B       1
Name: count, Length: 4632, dtype: int64

### Azalan şekilde en çok sipariş edilen 5 ürün

In [22]:
df['Invoice'].value_counts()[:20]

Invoice
537434    675
538071    652
537638    601
537237    597
536876    593
536592    592
537823    591
536031    582
490074    580
491966    579
537240    568
490149    559
491969    548
490741    546
537666    536
536544    527
489857    516
513574    515
490745    507
489597    502
Name: count, dtype: int64

In [27]:
df['Invoice'].value_counts()[:20].index

Index(['537434', '538071', '537638', '537237', '536876', '536592', '537823',
       '536031', '490074', '491966', '537240', '490149', '491969', '490741',
       '537666', '536544', '489857', '513574', '490745', '489597'],
      dtype='object', name='Invoice')

In [50]:
u = df[(df['Invoice'].isin(df['Invoice'].value_counts()[:50].index)) & (df['Customer ID'].isna() == False)]
if u: print('yes')
else: print('no')

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [53]:
top_limit = 1
while True:
    df_result = df[(df['Invoice'].isin(df['Invoice'].value_counts()[:top_limit].index)) & (df['Customer ID'].isna() == False)]
    if not df_result.empty: 
        print('Top limit:', top_limit)
        break
    else: top_limit+=1

Top limit: 91

Bonus: Artan şekilde en çok sipariş edilen 10 ürün.

In [43]:
df['Invoice'].value_counts().sort_values(ascending=True)[:10]

Invoice
533787     1
C501323    1
538142     1
538141     1
538144     1
C538098    1
501295     1
501294     1
C501293    1
C501271    1
Name: count, dtype: int64

In [56]:
df.head(5)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,12/1/2009 7:45,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,12/1/2009 7:45,1.25,13085.0,United Kingdom

### Ürüne ödenen miktarı belirten total_price adında bir alan oluşturma.

In [60]:
df.groupby('StockCode')['Price'].sum()

StockCode
10002           314.51
10002R           15.40
10080             5.10
10109             0.42
10120            12.28
                 ...
gift_0001_60      0.00
gift_0001_70     59.57
gift_0001_80    139.12
gift_0001_90      0.00
m                12.50
Name: Price, Length: 4632, dtype: float64

In [146]:
df_ = df.groupby('StockCode')['Price'].sum()

In [153]:
df_.to_frame()

               Price
StockCode
10002         314.51
10002R         15.40
10080           5.10
10109           0.42
10120          12.28
...              ...
gift_0001_60    0.00
gift_0001_70   59.57
gift_0001_80  139.12
gift_0001_90    0.00
m              12.50

[4632 rows x 1 columns]

In [151]:
pd.merge(df, df_, on='StockCode')

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price_x,Customer ID,Country,total_price,Invoice Amount,Price_y
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom,2870.78,83.40,2870.78
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,2460.27,81.00,2460.27
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,3247.15,81.00,3247.15
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,12/1/2009 7:45,2.10,13085.0,United Kingdom,703.61,100.80,703.61
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,12/1/2009 7:45,1.25,13085.0,United Kingdom,2661.45,30.00,2661.45
...,...,...,...,...,...,...,...,...,...,...,...
525456,538171,22271,FELTCRAFT DOLL ROSIE,2,12/9/2010 20:01,2.95,17530.0,United Kingdom,1693.22,5.90,1693.22
525457,538171,22750,FELTCRAFT PRINCESS LOLA DOLL,1,12/9/2010 20:01,3.75,17530.0,United Kingdom,1054.96,3.75,1054.96
525458,538171,22751,FELTCRAFT PRINCESS OLIVIA DOLL,1,12/9/2010 20:01,3.75,17530.0,United Kingdom,807.21,3.75,807.21
525459,538171,20970,PINK FLORAL FELTCRAFT SHOULDER BAG,2,12/9/2010 20:01,3.75,17530.0,United Kingdom,1404.17,7.50,1404.17
525460,538171,21931,JUMBO STORAGE BAG SUKI,2,12/9/2010 20:01,1.95,17530.0,United Kingdom,2816.88,3.90,2816.88

In [64]:
total_price_col = df.groupby('StockCode')['Price'].transform('sum')

In [65]:
df['total_price'] = total_price_col

In [67]:
df.head(3)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom,2870.78
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,2460.27
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,3247.15

In [70]:
df.sort_values(by='StockCode')[:3]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
508404,536863,10002,INFLATABLE POLITICAL GLOBE,1,12/3/2010 11:19,0.85,17967.0,United Kingdom,314.51
477013,534210,10002,INFLATABLE POLITICAL GLOBE,6,11/21/2010 15:56,0.85,18069.0,United Kingdom,314.51
476983,534211,10002,INFLATABLE POLITICAL GLOBE,12,11/21/2010 15:56,0.85,13050.0,United Kingdom,314.51

In [72]:
df.sort_values(by='StockCode')[1000:1003]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
492082,535407,11001,ASSTD DESIGN RACING CAR PEN,2,11/26/2010 11:20,3.36,NaN,United Kingdom,291.68
478237,534319,11001,ASSTD DESIGN RACING CAR PEN,1,11/22/2010 11:37,3.36,NaN,United Kingdom,291.68
159581,504593,11001,ASSTD DESIGN RACING CAR PEN,16,4/15/2010 10:43,1.69,13901.0,United Kingdom,291.68

In [73]:
df.sort_values(by='StockCode')[1500:1503]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
92309,498101,15036,ASSORTED COLOURS SILK FAN,24,2/16/2010 13:32,0.65,12960.0,United Kingdom,449.44
112429,500135,15036,ASSORTED COLOURS SILK FAN,24,3/4/2010 15:44,0.75,16096.0,United Kingdom,449.44
20542,491043,15036,ASSORTED COLOURS SILK FAN,1,12/9/2009 9:51,1.30,NaN,United Kingdom,449.44

StockCode'u aynı olanların total_price'ı da aynı. Bunu yukarıda gözlemleyebiliriz.

### İptal edilen işlemlerin başında C ifadesi geçiyor. İptal edilen işlemleri listeleme.

In [74]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom,2870.78
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,2460.27
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,3247.15
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,12/1/2009 7:45,2.10,13085.0,United Kingdom,703.61
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,12/1/2009 7:45,1.25,13085.0,United Kingdom,2661.45

### İptal edilen ürünleri çıkarma (Fatura isimleri 'C' ile başlıyor)

In [133]:
cancelled_invoice = df[df['Invoice'].str.startswith('C')].reset_index(drop=True)

In [134]:
cancelled_invoice

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price,Invoice Amount
0,C489449,22087,PAPER BUNTING WHITE LACE,-12,12/1/2009 10:33,2.95,16321.0,Australia,1961.85,-35.40
1,C489449,85206A,CREAM FELT EASTER EGG BASKET,-6,12/1/2009 10:33,1.65,16321.0,Australia,391.62,-9.90
2,C489449,21895,POTTING SHED SOW 'N' GROW SET,-4,12/1/2009 10:33,4.25,16321.0,Australia,421.62,-17.00
3,C489449,21896,POTTING SHED TWINE,-6,12/1/2009 10:33,2.10,16321.0,Australia,490.57,-12.60
4,C489449,22083,PAPER CHAIN KIT RETRO SPOT,-12,12/1/2009 10:33,2.95,16321.0,Australia,2973.13,-35.40
...,...,...,...,...,...,...,...,...,...,...
10201,C538123,22956,36 FOIL HEART CAKE CASES,-2,12/9/2010 15:41,2.10,12605.0,Germany,198.54,-4.20
10202,C538124,M,Manual,-4,12/9/2010 15:43,0.50,15329.0,United Kingdom,536942.69,-2.00
10203,C538124,22699,ROSES REGENCY TEACUP AND SAUCER,-1,12/9/2010 15:43,2.95,15329.0,United Kingdom,1460.50,-2.95
10204,C538124,22423,REGENCY CAKESTAND 3 TIER,-1,12/9/2010 15:43,12.75,15329.0,United Kingdom,31386.40,-12.75
10205,C538164,35004B,SET OF 3 BLACK FLYING DUCKS,-1,12/9/2010 17:32,1.95,14031.0,United Kingdom,1249.82,-1.95

### En çok iade alan ürün

In [139]:
cancelled_invoice['StockCode'].value_counts().head(1)

StockCode
M    294
Name: count, dtype: int64

### İptal edilen ürünleri silme

In [95]:
df2 = df.copy()
df2.head(3)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom,2870.78
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,2460.27
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,3247.15

In [99]:
df2 = df2[~df2['Invoice'].str.startswith('C')]

In [100]:
df2.head(3)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom,2870.78
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,2460.27
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,3247.15

İptal edilen (Invoice kolonunda başında C olan) satırları ayıkladık ve df2 veri çerçevesinde sakladık.

### Her bir faturanın tutarını öğrenme

In [104]:
df['Invoice Amount'] = df['Quantity'] * df['Price']

In [105]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price,Invoice Amount
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom,2870.78,83.4
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,2460.27,81.0
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom,3247.15,81.0
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,12/1/2009 7:45,2.10,13085.0,United Kingdom,703.61,100.8
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,12/1/2009 7:45,1.25,13085.0,United Kingdom,2661.45,30.0

### Müşteri bazında ortalama sipariş sayısı ve sipariş tutarı

Müşteri bazında ortalama sipariş sayısı:

Toplam sipariş sayısı / Toplam müşteri sayısı

In [123]:
float(format(df['Invoice'].nunique() / df['Customer ID'].nunique(), '.2f'))

6.57

Müşteri bazında ortalama sipariş tutarı

In [112]:
df.groupby('Customer ID')['Invoice Amount'].sum()

Customer ID
12346.0     -64.68
12347.0    1323.32
12348.0     222.16
12349.0    2646.99
12351.0     300.93
            ...
18283.0     641.77
18284.0     436.68
18285.0     427.00
18286.0    1188.43
18287.0    2340.61
Name: Invoice Amount, Length: 4383, dtype: float64

### Müşteri bazında sipariş edilen toplam ürün sayısı ve toplam sipariş sayısı

Müşteri bazında sipariş edilen toplam ürün sayısı

In [114]:
df.groupby('Customer ID')['StockCode'].nunique()

Customer ID
12346.0     29
12347.0     70
12348.0     20
12349.0     92
12351.0     21
          ...
18283.0    158
18284.0     28
18285.0     12
18286.0     67
18287.0     78
Name: StockCode, Length: 4383, dtype: int64

Müşteri bazında toplam sipariş sayısı

In [113]:
df.groupby('Customer ID')['Invoice'].nunique()

Customer ID
12346.0    15
12347.0     2
12348.0     1
12349.0     4
12351.0     1
           ..
18283.0     6
18284.0     2
18285.0     1
18286.0     3
18287.0     5
Name: Invoice, Length: 4383, dtype: int64

### Hangi ülkeden kaçar tane sipariş var?

In [125]:
df.groupby('Country')['Invoice'].nunique()

Country
Australia                  50
Austria                    32
Bahrain                     8
Belgium                    65
Bermuda                     1
Brazil                      1
Canada                      2
Channel Islands            47
Cyprus                     25
Denmark                    33
EIRE                      457
Finland                    20
France                    297
Germany                   513
Greece                     15
Hong Kong                   6
Iceland                     2
Israel                      2
Italy                      39
Japan                      30
Korea                       3
Lebanon                     2
Lithuania                   6
Malta                       6
Netherlands               150
Nigeria                     3
Norway                     15
Poland                     15
Portugal                   57
RSA                         4
Singapore                   4
Spain                      85
Sweden                     83
Switzerland                50
Thailand                    2
USA                        18
United Arab Emirates       19
United Kingdom          26633
Unspecified                15
West Indies                 1
Name: Invoice, dtype: int64

### En çok para kazandıran 5 ülke?

Burada ince bir detay olarak, iptal edilen siparişleri çıkardığımız df2 veri çerçevesini kullanalım.

In [127]:
df2['Invoice Amount'] = df2['Quantity'] * df2['Price']

In [131]:
df2.groupby('Country')['Invoice Amount'].sum().sort_values(ascending=False)[:5]

Country
United Kingdom    8709203.673
EIRE               380977.820
Netherlands        268786.000
Germany            202395.321
France             147211.490
Name: Invoice Amount, dtype: float64